
### :robot: Terraform Report
---
##### Plan: `2` to add, `1` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.argocd_app_dns[0] will be created
  + resource "helm_release" "argocd_app_dns" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-app-dns"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                applications:
                  dns-kiali:
                    namespace: argocd
                    project: dns-apps
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                
                    sources:
                    - repoURL: 'https://github.com/innovats-hub/system-apps-aks.git'
                      path: 'manifests/kiali/virtual-service.yml'
                
                    destination:
                      server: https://kubernetes.default.svc
                      namespace: istio-system
                
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                      - CreateNamespace=true
                
                  dns-grafana:
                    namespace: argocd
                    project: dns-apps
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                
                    sources:
                    - repoURL: 'https://github.com/innovats-hub/system-apps-aks.git'
                      path: 'manifests/grafana/virtual-service.yml'
                
                    destination:
                      server: https://kubernetes.default.svc
                      namespace: monitoring
                
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                      - CreateNamespace=true
                
                projects:
                  dns-apps:
                    namespace: argocd
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                    description: Project DNS apps
                    sourceRepos:
                    - '*'
                    destinations:
                    - namespace: argocd
                      server: https://kubernetes.default.svc
                    clusterResourceWhitelist:
                    - group: '*'
                      kind: '*'
            EOT,
        ]
      + verify                     = false
      + version                    = "2.0.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.argocd_app_kiali[0] will be updated in-place
  ~ resource "helm_release" "argocd_app_kiali" {
        id                         = "argocd-app-kiali"
      ~ metadata                   = [
          - {
              - app_version    = ""
              - chart          = "argocd-apps"
              - first_deployed = 1730056597
              - last_deployed  = 1730056597
              - name           = "argocd-app-kiali"
              - namespace      = "argocd"
              - notes          = ""
              - revision       = 1
              - values         = jsonencode(
                    {
                      - applications = {
                          - kiali = {
                              - destination = {
                                  - namespace = "istio-system"
                                  - server    = "https://kubernetes.default.svc"
                                }
                              - finalizers  = [
                                  - "resources-finalizer.argocd.argoproj.io",
                                ]
                              - namespace   = "argocd"
                              - project     = "kiali"
                              - sources     = [
                                  - {
                                      - chart          = "kiali-server"
                                      - helm           = {
                                          - parameters  = [
                                              - {
                                                  - name  = "auth.strategy"
                                                  - value = "token"
                                                },
                                              - {
                                                  - name  = "external_services.prometheus.url"
                                                  - value = "http://prometheus-server.monitoring.svc.cluster.local"
                                                },
                                              - {
                                                  - name  = "external_services.grafana.enabled"
                                                  - value = "false"
                                                },
                                              - {
                                                  - name  = "external_services.custom_dashboards.enabled"
                                                  - value = "false"
                                                },
                                            ]
                                          - releaseName = "kiali"
                                        }
                                      - repoURL        = "https://kiali.org/helm-charts"
                                      - targetRevision = "2.0.0"
                                    },
                                ]
                              - syncPolicy  = {
                                  - automated   = {
                                      - prune    = true
                                      - selfHeal = true
                                    }
                                  - syncOptions = [
                                      - "CreateNamespace=true",
                                    ]
                                }
                            }
                        }
                      - projects     = {
                          - kiali = {
                              - clusterResourceWhitelist = [
                                  - {
                                      - group = "*"
                                      - kind  = "*"
                                    },
                                ]
                              - description              = "Project Kiali for Service Mesh"
                              - destinations             = [
                                  - {
                                      - namespace = "istio-system"
                                      - server    = "https://kubernetes.default.svc"
                                    },
                                ]
                              - finalizers               = [
                                  - "resources-finalizer.argocd.argoproj.io",
                                ]
                              - namespace                = "argocd"
                              - sourceRepos              = [
                                  - "*",
                                ]
                            }
                        }
                    }
                )
              - version        = "2.0.2"
            },
        ] -> (known after apply)
        name                       = "argocd-app-kiali"
      ~ values                     = [
          - <<-EOT
                applications:
                  kiali:
                    namespace: argocd
                    project: kiali
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                
                    sources:
                    - chart: kiali-server
                      repoURL: https://kiali.org/helm-charts
                      targetRevision: 2.0.0
                      helm:
                        releaseName: kiali
                        parameters:
                          - name: auth.strategy
                            value: "token"
                          - name: external_services.prometheus.url
                            value: "http://prometheus-server.monitoring.svc.cluster.local"
                          - name: external_services.grafana.enabled
                            value: "false"
                          - name: external_services.custom_dashboards.enabled
                            value: "false"
                
                    destination:
                      server: https://kubernetes.default.svc
                      namespace: istio-system
                
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                      - CreateNamespace=true
                
                projects:
                  kiali:
                    namespace: argocd
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                    description: Project Kiali for Service Mesh
                    sourceRepos:
                    - '*'
                    destinations:
                    - namespace: istio-system
                      server: https://kubernetes.default.svc
                    clusterResourceWhitelist:
                    - group: '*'
                      kind: '*'
            EOT,
          + <<-EOT
                applications:
                  kiali:
                    namespace: argocd
                    project: kiali
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                
                    sources:
                    - chart: kiali-server
                      repoURL: https://kiali.org/helm-charts
                      targetRevision: 2.0.0
                      helm:
                        releaseName: kiali
                        parameters:
                          - name: auth.strategy
                            value: "token"
                          - name: external_services.prometheus.url
                            value: "http://prometheus-server.monitoring.svc.cluster.local"
                          - name: external_services.grafana.enabled
                            value: "false"
                          - name: external_services.custom_dashboards.enabled
                            value: "false"
                    - repoURL: 'https://github.com/innovats-hub/system-apps-aks.git'
                      path: 'manifests/kiali/dashboard-auth.yml'
                
                    destination:
                      server: https://kubernetes.default.svc
                      namespace: istio-system
                
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                      - CreateNamespace=true
                
                projects:
                  kiali:
                    namespace: argocd
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                    description: Project Kiali for Service Mesh
                    sourceRepos:
                    - '*'
                    destinations:
                    - namespace: istio-system
                      server: https://kubernetes.default.svc
                    clusterResourceWhitelist:
                    - group: '*'
                      kind: '*'
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

  # kubectl_manifest.ingress_argocd[0] will be created
  + resource "kubectl_manifest" "ingress_argocd" {
      + api_version             = "networking.istio.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "VirtualService"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "argocd"
      + namespace               = "argocd"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: networking.istio.io/v1
            kind: VirtualService
            metadata:
              name: argocd
              namespace: argocd
            spec:
              gateways:
              - istio-system/innovatshub-dev
              hosts:
              - argocd.dev.innovatshub.com
              http:
              - match:
                - uri:
                    prefix: /
                route:
                - destination:
                    host: argocd-server
                    port:
                      number: 80
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11543583690`](https://github.com/innovats-hub/system-apps-aks/actions/runs/11543583690) - commit c2bd071b2b18c6b0f09be485fc3e45792505094a
